Repository: phai-nguyen/EKA2L1-S60-OMAP2420-iOS
Catalog: patches/Localizable.xcstrings
Source language: en
Languages: vi, zh_hans

# settings.airplay.hint
source: Open Control Center, choose Screen Mirroring, and select your TV or Mac.
vi: Mở Trung tâm điều khiển, chọn Phản chiếu màn hình rồi chọn TV hoặc máy Mac của bạn.
zh_hans: 打开“控制中心”，选择“屏幕镜像”，然后选择你的电视或 Mac。

# settings.device
source: Device
vi: Thiết bị
zh_hans: 设备

# settings.discord
source: Discord Server
vi: Máy chủ Discord
zh_hans: Discord 服务器

# settings.exportLog
source: Export Log
vi: Xuất log
zh_hans: 导出日志

# settings.fpsOverlay
source: FPS overlay
vi: Hiển thị FPS
zh_hans: 帧率显示

# settings.friendlyPhoneName
source: Friendly phone name
vi: Tên điện thoại thân thiện
zh_hans: 手机显示名称

# settings.graphics
source: Graphics
vi: Đồ họa
zh_hans: 图形

# settings.hideSystemApps
source: Hide system apps
vi: Ẩn ứng dụng hệ thống
zh_hans: 隐藏系统应用

# settings.hosts.add
source: Add Host Mapping
vi: Thêm ánh xạ host
zh_hans: 添加主机名映射

# settings.hosts.address
source: Target and Optional Port
vi: Đích và cổng tùy chọn
zh_hans: 目标及可选端口

# settings.hosts.addressHint
source: Enter an IPv4 address, IPv6 address or hostname, optionally followed by a port.
vi: Nhập địa chỉ IPv4, IPv6 hoặc tên máy chủ, có thể kèm cổng.
zh_hans: 请输入 IPv4 地址、IPv6 地址或主机名，并可指定端口。

# settings.hosts.duplicate
source: This hostname already has a mapping. Edit the existing entry.
vi: Tên máy chủ này đã có ánh xạ. Hãy sửa mục hiện có.
zh_hans: 该主机名已有映射，请编辑现有条目。

# settings.hosts.entry
source: Host Mapping
vi: Ánh xạ host
zh_hans: 主机名映射

# settings.hosts.hint
source: Redirect guest hostnames or wildcard suffixes to an IP address or another hostname, optionally with a port. Changes affect new connections; restart the game if it has cached an address.
vi: Chuyển hướng tên máy chủ của máy khách hoặc hậu tố ký tự đại diện đến địa chỉ IP hay tên máy chủ khác, có thể kèm cổng. Thay đổi áp dụng cho kết nối mới; hãy khởi động lại game nếu game đã lưu địa chỉ vào bộ nhớ đệm.
zh_hans: 将客户机主机名或通配后缀重定向到 IP 地址或另一个主机名，并可指定端口。更改对新连接生效；如果游戏已缓存地址，请重新启动。

# settings.hosts.hostname
source: Hostname or *.suffix
vi: Tên máy chủ hoặc *.hậu_tố
zh_hans: 主机名或 *.后缀

# settings.hosts.invalidAddress
source: Enter a valid IP address or hostname with an optional port.
vi: Nhập địa chỉ IP hoặc tên máy chủ hợp lệ, có thể kèm cổng.
zh_hans: 请输入有效的 IP 地址或主机名，并可指定端口。

# settings.hosts.invalidHostname
source: Enter a hostname or *.suffix using letters, numbers, hyphens, underscores and dots.
vi: Nhập tên máy chủ hoặc *.hậu_tố bằng chữ cái, số, dấu gạch ngang, gạch dưới và dấu chấm.
zh_hans: 请输入主机名或 *.后缀，可使用字母、数字、连字符、下划线和点。

# settings.hosts.saveError
source: The host mappings could not be saved.
vi: Không thể lưu ánh xạ host.
zh_hans: 无法保存主机名映射。

# settings.hosts.title
source: Host Overrides
vi: Ghi đè host
zh_hans: 主机名覆盖

# settings.integerScaling
source: Integer scaling
vi: Tỷ lệ số nguyên
zh_hans: 整数倍缩放

# settings.jit
source: JIT recompiler (dynarmic)
vi: Trình biên dịch lại JIT (dynarmic)
zh_hans: JIT 重编译器（dynarmic）

# settings.jit.hint
source: Faster CPU emulation. Applies on the next app launch. Experimental: some apps may crash — turn it off if games misbehave.
vi: Giả lập CPU nhanh hơn. Áp dụng từ lần mở ứng dụng tiếp theo. Tính năng thử nghiệm: một số ứng dụng có thể bị crash — hãy tắt nếu game hoạt động không ổn định.
zh_hans: 更快的 CPU 模拟，在下次启动应用时生效。实验性功能：部分应用可能崩溃——如果游戏异常请关闭它。

# settings.jit.unavailable
source: JIT permission is not active for this process. Enable JIT (debugger or a JIT enabler such as SideStore/StikDebug) and relaunch; otherwise the interpreter is used.
vi: Quyền JIT chưa hoạt động cho tiến trình này. Hãy bật JIT (bằng trình gỡ lỗi hoặc công cụ bật JIT như SideStore/StikDebug) rồi mở lại ứng dụng; nếu không, trình thông dịch sẽ được sử dụng.
zh_hans: 当前进程未获得 JIT 权限。请启用 JIT（使用调试器，或 SideStore/StikDebug 等 JIT 启用工具）后重新启动应用；否则将使用解释器。

# settings.keypadOpacity
source: Keypad opacity
vi: Độ mờ bàn phím
zh_hans: 键盘不透明度

# settings.library
source: Library
vi: Thư viện
zh_hans: 应用库

# settings.license
source: Licensed under GPLv3
vi: Phát hành theo GPLv3
zh_hans: 基于 GPLv3 授权

# settings.nearestFiltering
source: Nearest filtering
vi: Lọc điểm gần nhất
zh_hans: 邻近过滤

# settings.netplay
source: Bluetooth Netplay
vi: Chơi mạng Bluetooth
zh_hans: 蓝牙联机

# settings.netplay.directIpHint
source: Peers reach this device at its IP address and the discovery port above, so enter that pair on their side.
vi: Máy ngang hàng truy cập thiết bị này bằng địa chỉ IP và cổng khám phá ở trên, vì vậy hãy nhập cặp thông tin đó ở phía họ.
zh_hans: 其他玩家通过本机的 IP 地址和上面的发现端口连接，请把这两项告诉他们。

# settings.netplay.discoveryMode
source: Discovery mode
vi: Chế độ khám phá
zh_hans: 发现模式

# settings.netplay.friendAddress
source: IP address
vi: Địa chỉ IP
zh_hans: IP 地址

# settings.netplay.friendPort
source: Port
vi: Cổng
zh_hans: 端口

# settings.netplay.hint
source: Emulates Symbian Bluetooth multiplayer over the network. Changes apply from the next app launch. iOS will ask for Local Network permission on first use.
vi: Giả lập chơi nhiều người qua Bluetooth của Symbian thông qua mạng. Thay đổi áp dụng từ lần mở ứng dụng tiếp theo. iOS sẽ yêu cầu quyền Mạng cục bộ trong lần sử dụng đầu tiên.
zh_hans: 通过网络模拟 Symbian 蓝牙多人游戏。更改将在下次启动应用时生效。首次使用时 iOS 会请求本地网络权限。

# settings.netplay.listenPort
source: Discovery port
vi: Cổng khám phá
zh_hans: 发现端口

# settings.netplay.mode.directIp
source: Direct IP
vi: IP trực tiếp
zh_hans: 直连 IP

# settings.netplay.mode.lan
source: Local network
vi: Mạng cục bộ
zh_hans: 局域网

# settings.netplay.mode.off
source: Off
vi: Tắt
zh_hans: 关闭

# settings.netplay.mode.server
source: Central server
vi: Máy chủ trung tâm
zh_hans: 中央服务器

# settings.netplay.password
source: Password
vi: Mật khẩu
zh_hans: 密码

# settings.netplay.serverUrl
source: Server address
vi: Địa chỉ máy chủ
zh_hans: 服务器地址

# settings.network
source: Network
vi: Mạng
zh_hans: 网络

# settings.noLog
source: No log file yet
vi: Chưa có tệp log
zh_hans: 暂无日志文件

# settings.performanceMode
source: Performance mode
vi: Chế độ hiệu năng
zh_hans: 运行模式

# settings.performanceMode.balanced
source: Balanced
vi: Cân bằng
zh_hans: 平衡

# settings.performanceMode.high
source: High performance
vi: Hiệu năng cao
zh_hans: 高性能

# settings.peripherals
source: Connected devices
vi: Thiết bị đã kết nối
zh_hans: 已连接的设备

# settings.support
source: Support
vi: Hỗ trợ
zh_hans: 支持

# settings.system
source: System
vi: Hệ thống
zh_hans: 系统

# settings.systemLanguage
source: System language
vi: Ngôn ngữ hệ thống
zh_hans: 系统语言

# settings.title
source: Settings
vi: Cài đặt
zh_hans: 设置

# settings.wiki
source: Emulator Wiki
vi: Wiki trình giả lập
zh_hans: 模拟器 Wiki

# common.ok
source: OK
zh_hans: 好

# emulator.notice
source: Game
zh_hans: 游戏

# import.source.firmware
source: Firmware VPL / FPSX
zh_hans: 固件 VPL / FPSX

# keypad.editor.dpad
source: D-pad
zh_hans: 方向键
